Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/continuing_education_and_training.html.txt.tmx
Source language: en
Languages: ga

source: Education and training supports
ga: Traenáil agus oideachas leanúnach

source: There are lots of ways to continue your education, further your training and acquire new skills
ga: Tá a lán bealach chun leanacht ar aghaidh le do chuid oideachais agus do chuid traenála praiticiúil a fheabhsú, seachas dul trí chóras na scoile agus córas na gcoláistí

source: If you are leaving school, unemployed or looking for your first job, or if you are looking to change direction in your career, you can choose from a large number of education and training programmes funded by SOLAS, the Education and Training Boards (ETBs), and various government departments and agencies
ga: Má tá tú dífhostaithe nó ag cuartú poist don chéad uair nó má tá tú ag athrú treo do shlí beatha, is féidir leat roghnú ón a lán cúrsaí oideachais agus cúrsaí traenála éagsúla atá maoinithe ag FÁS, na coiste gairmoideachais, na ranna rialtais agus eagraíochtaí eile

source: These offer a wide range of full-time and part-time options so you can choose the one that best suits your circumstances
ga: Tairiscíonn siad seo réimse leathan de chúrsaí lánaimseartha agus páirtaimseartha. Mar sin, is féidir leat an ceann is fearr a oireann do do chuid riachtanas a roghnú

source: Eligibility conditions and training allowances vary widely from course to course, so you should check the details of each course carefully
ga: Tá an-difríocht idir cúrsaí ó thaobh coinníollacha, cearta agus liúntais traenála. Mar sin, caithfidh tú sonraí gach cúrsa a sheiceaíl go cúramach

source: In addition to the options listed below, you may also be able to access education and training if you are involved in a youth group, a community group or some other form of voluntary activity
ga: Seans go dteastaíonn uait do scileanna a fheabhsú má tá post agat cheana féin, go háirithe má tá obair ghearr-ama ar siúl agat

source: Vocational Training Opportunities Scheme (VTOS): provides an opportunity to return to full-time education if you are an unemployed adult or getting certain social welfare payments
ga: Taobh amuigh de na cursaí liostáilte thíos, is féidir teacht ar oideachas má tá baint agat le grúpa óige, grúpa pobail, nó le aon sórt imeachtaí deonacha eile

source: Courses are designed to meet the education and training needs of unemployed people and are particularly suitable if you have been out of school for some time
ga: Téigh chun cainte le comhordanóir an ghrúpa atá baint agat leis agus faigh aon eolas faoi dheiseanna oideachais agus traenála atá ar fáil taobh istigh den eagraíocht sin

source: Back to Education Programme: provides an opportunity to return to part-time or full-time education while continuing to get income supports such as the Back to Education Allowance or keep your social welfare payment
ga: Scéim Deiseanna Gairmoiliúna (SDGO): Tugann SGDO deis duit filleadh ar an oideachas lánaimseartha más aosach dífhostaithe tú nó má tá sochair áirithe á bhfáil agat

source: You must be getting a social welfare payment and meet certain other criteria
ga: Ceann de na haidhmeanna atá leis an scéim ná deiseanna oideachais agus oiliúna a thabhairt do dhaoine dífhostaithe a fhorbróidh a n-infhostaitheacht

source: Post Leaving Certificate (PLC) courses: PLC courses are open to school-leavers and adult participants, offering a mixture of practical work, academic work and work experience
ga: Aidhm eile atá léi ná daoine a réiteach le dul i mbun fostaíochta íoctha nó i mbun deiseanna eile as a leanann fostaíocht íoctha

source: Further Education and Training (FET) courses: provide an opportunity to develop or upgrade your skills in the commercial and industrial sectors if you are unemployed or redundant
ga: Cúrsaí oiliúna FÁS: Tugann cúrsaí oiliúna FÁS deis duit do scileanna a fhorbairt nó a uasghrádú sna hearnálacha tráchtála agus tionscail má tá tú dífhostaithe nó má briseadh as do phost tú mar gheall ar bheith iomarcach

source: Most courses are free and you may get a Further Education and Training (FET) training allowance depending on your circumstances
ga: Is féidir leat cúrsaí oiliúna FÁS a chuardach ar líne

source: Work placement programme: offers work experience and you may be able to keep your social welfare payment
ga: Cúrsaí Iar Ard-Teistiméireachta (IAT): Tá eolas anseo ar chúrsaí IAT, céard atá iontu, iaratais, liúntaisí agus cé atá i dteideal an cúrsa a dhéanamh

source: It is aimed at people who have been either getting a jobseeker’s payment or signing for credits for at least 3 months. Participants in the scheme will be offered an internship of 6 or 9 months with a host organisation
ga: Cuireann Socrúcháin oibre FÁS taithí oibre ar fáil agus d’fhéadfá a bheith in ann d’íocaíochta leasa shóisialaigh a choinneáil

source: You can keep your social welfare payment for as long are you are entitled to it while you are participating on a Springboard course
ga: Cuirfidh an Clár Ardoideachais Springboard 6,000 áiteanna ardoideachais do dhaoine dífhostaithe i 2011

source: Skills for Work: provides training and educational opportunities for those in part-time or full-time employment
ga: Tá sé mar aidhm ag an gclár áiteanna a chur ar fáil do dhaoine a d'oibrigh san earnáil tógála, déantúsaíochta agus earnála eile den gheilleagar gur dócha nach dtiocfaidh ar ais go leibhéil réamh-mheathlú

source: It helps you to improve the basic skills you need in the workplace such as literacy, numeracy and IT skills
ga: Tosófar na cúrsaí i bhfómhair 2011

source: Skills for Work is delivered by the Educational and Training Boards
ga: Faigh tuilleadh eolais mar gheall ar Springboard inár ndoiciméad ar áiteanna tríú leibhéal do dhaoine dífhostaithe

source: Skillnets: enables groups of private sector companies to set up training networks to deliver a range of accredited and/or industry-recognised programmes
ga: Cuireann Skillnets Ltd ar chumas ghrúpaí de chuideachtaí san earnáil phríobháideach líonraí oiliúna a bhunú chun réimse clár atá creidiúnaithe agus/nó aitheanta ag an tionscal a sheachadadh.Sa chlár 2010, cuirfidh líonraí Skillnets roinnt oiliúna ar fáil do dhaoine cáilithe dífhostaithe

source: Skillnets networks offer some training to eligible unemployed people
ga: Má tá tú dífhostaithe ní íocfaidh tú as an oiliúint seo agus ní chuirfear isteach ar do shochair leasa shóisialaigh

source: If you are unemployed you will not pay for this training
ga: Is féidir leat aimsigh cúrsaí oiliúna ar láithreán gréasáin Skillnets

source: Youthreach: If you are between 15 and 20 years of age and have left school without any formal qualifications, the Youthreach programme will provide you with opportunities for basic education, personal development, vocational training and work experience
ga: Youthreach: Má tá tú idir 15 agus 20 agus má d'fhág tú an scoil gan aon chailíochtaí foirmiúla, tá deiseanna ar fáil ó Youthreach bunoideachas, forbairt phearsanta, traenáil gairmiúil agus taithí oibre a fháil

source: FIT (Fastrack to IT): provides targeted information technology training for people who are getting certain social welfare payments or signing for credits. Courses include office administration, web design and programming, broadband communications and PC maintenance
ga: Eagraíochtaí eile: Cuireann eagraíochtaí mar Fáilte Ireland, Bord Iascaigh Mhara (BIM), Teagasc, Coillte, agus Comhairle Ceardaíochta na h-Éireann réimse leathan de chúrsaí áirithe ar fáil

source: Momentum: provides education and training courses for long-term unemployed people. It includes education, work placement and support
ga: MMTF (Modh Mear don Teicneolaíocht Faisnéise): Soláthraíonn an scéim seo oiliúint dhírithe sa teicneolaíocht faisnéise do dhaoine a bhfuil sochair áirithe á bhfáil acu nó atá ag síneáil le haghaidh ranníocaíochtaí chreidiúnaithe árachais shóisialaigh

source: You can keep your social welfare payment for as long are you are entitled to it while you are participating on a Momentum course
ga: Tá riarachán oifige, dearadh gréasáin agus ríomhchlárú, cumarsáid leathanbhanda agus cothabháil RP (Ríomhaire Pearsanta) i measc na gcúrsaí

source: If you are on a full-time Momentum course and you need childcare, you may qualify for a free childcare place under the Childcare Employment and Training Support (CETS) scheme
ga: Is féidir leat tuilleadh a fháil amach faoi chúrsaí oiliúna ar láithreán gréasáin MMTF

source: Skills training with State agencies: Some State agencies offer a range of specialist courses in their particular commercial or industrial sectors
ga: Tosóidh tionscnamh Rialtais Momemtum i 2013, a chuirfidh tionscadail saoroideachais agus oiliúna ar fáil do chuardaitheoirí fadtéarmacha poist (atá dífhostaithe ar feadh 12 mhí nó níos mó)

source: Some of these training courses are at third level and require you to have formal qualifications and to apply through the Central Applications Office as you would for any other third-level course
ga: Cabhróidh Momentum leo scileanna a bhfuil éileamh orthu a fháil agus rochtain a fháil ar obair in earnálacha den gheilleagar ina bhfuil deiseanna ar phoist. Cuimseoidh oiliúint, taithí oibre agus tacaíocht

source: Department of Justice and Equality workshops: If you are coming to education and training from the prison system or as an alternative to the prison system, you may find a suitable course under this scheme operated by the Department of Justice and Equality
ga: Ceardlanna na Roinn Dlí agus Cirt agus Comhionannais: Má tá tú ag teacht ar oideachas agus traenáil ón gcóras príosúin, nó in ionadan chóras priosúin d'fhéadfá cúrsa feiliúnach a fháil faoin gcóras seo a chuireann an Roinn Dlí agus Cirt agus Comhionannais, FÁS, agus na Coistí Gairmoideachais ar fáil

source: Night classes: Self-funded educational opportunities are available to you through a range of night courses organised by your local ETB and many colleges and universities
ga: Ranganna oíche: Tá fáil ar deiseanna oideachasúla atá féinmhaoinithe trí ranganna oíche atá eagraithe ag an gCoiste Gairmoideachais áitiúil, Ionaid Traenála FÁS agus go leor de na coláistí agus ollscoileanna ar fud na tíre

source: Skillstowork.ie is a useful tool to find out which of the 4 initiatives - Springboard, Momentum, JobBridge and Skillnets - best suits you
ga: Skillstowork.ie - is uirlis úsáideach í chun a fháil amach cé acu ceann de na 4 thionscnamh - Springboard, Momentum, JobBridge agus Skillnets - is fearr a oireann duit

source: FÁS, SOLAS and ETBs
ga: Boird Oideachais agus Oiliúna

source: All training courses will have transferred to ETBs on 1 July 2014
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna (BOO) in áit coistí gairmoideachais

source: If you are currently on a training course, you will not be affected by these changes
ga: Leanfaidh na BOO an uile sheirbhíse soláthartha ag na coistí gairmoideachais a sholáthar
